import React from "react";
import { createRoot } from "react-dom/client";
import { configureStore } from "@reduxjs/toolkit";
import { Provider } from "react-redux";
import reducer from "./Reducer.jsx";
import AppView from "./AppView.jsx";

const store = configureStore({ reducer });          //  Конфігуруємо Redux store за допомогою переданого редюсера
store.dispatch({                                    //  Диспетчеризуємо дію "SET_STATE" зі стартовим станом
  type: "SET_STATE",
  state: {
    start:false,
    apiUser: "http://10.8.0.6:8000",
    login: "",
    idUser: "",
    pageMain:'/userpage',
    access_token:"",
    emailUser:"",
    userName:"Max",
    styleItem:
    {
      id:"",
      name: "",
      img:"",
        p:""
    },
    styleList:[
      {
        id:"1",
        name: "Steampunk",
        img:"https://images.saatchiart.com/saatchi/1275081/art/9190403/8253555-ARONDXVO-32.jpg",
          p:"Події що відбуваються у світі, де парові та інші складні механічні машини є основною технологією..."
      },
      {
        id:"2",
        name: "Cередньовіччя",
        img:"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT2QzKrOYfh3UsmOL5caIU0qTqq3KF79Nv6Xw&usqp=CAU",
        p:"Період історії приблизно з VI до XVI ст. Епоха лицарів, королів та могутньої церкви..."
      },
      {
        id:"3",
        name: "Війна драконів",
        img:"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQYy441umVDUba3XusSJdFZD9ZY29gHI69DUg&usqp=CAU",
        p:"Коли на Землі жили страшні істоти, люди вірили, що вони здатні зруйнувати світ..."
      },
    ],
    massages:[],
   answerList:[
     {
       name: "Чому стосунки між драконами почали погіршуватися?",
       img:"https://hips.hearstapps.com/hmg-prod/images/syrax-2-1663003447.jpg?crop=0.750xw:1.00xh;0.219xw,0&resize=980:*",
         p:"Причиною були різні погляди на світ та домінуючий страх — Дракон Вогню переконаний, що магічна сила повинна підкорятися лише тим, хто має найбільшу силу, тоді як Дракон Льоду вважав, що магія повинна служити для блага всіх створінь і контролюватися з дбайливістю."
     },
     {
       name: "Вони намагались  знайти компроміс?",
       img:"https://chakiris.club/uploads/posts/2022-01/1642601583_1-chakiris-club-p-bitva-drakonov-fentezi-oboi-1.jpg",
       p:"Так, їх недолугі спроби знайти компроміс та знайти спільну мову завершились невдачею. Між драконами сталася величезна битва, а небо розсіялося від вогню та льоду. Десь на полі битви, під тяжкими ударами, прокотилася загадкова іскра — силова комета, що склалася з усіх крапель крові, пролитої на бойових полях, і усіх сльоз, пролитих у бідолах."
     },
     {
       name: "Хто переміг?",
       img:"https://img2.joyreactor.cc/pics/post/Anna-Podedworna-artist-Dragon-Drizzt-Do%E2%80%99Urden-7595308.jpeg",
       p:"І з того часу на полі битви з'явився  — Кристал Балансу. Він об'єднав у собі протилежні елементи вогню та льоду. Кристал випромінював велику силу, яка могла злагодити два протилежних дракони і принести мир у їхні королівства.Однак з'явилася нова загроза — група амбітних магів та прибічників обох драконів, які прагнули викрасти Кристал Балансу, щоб володіти його могутністю та здійснити свої амбіції."
     },

     {
      name: "Люди як завжди все зіпсували?",
      img:"https://img5.goodfon.ru/wallpaper/big/f/f1/kristall-voda-nebo-noch-mlechnyi-put-fentezi.jpg",
      p:"Маги завдали удару засадою, однак їх плани не вдалося реалізувати, бо Кристал Балансу забезпечив захист. Він почав змінювати магічний потік навколо себе, розсіюючи силу ненависті та агресії. Захищений кристалом, світ довкола поступово перетворювався."
    },   {
      name: "А дракони?",
      img:"https://chakiris.club/uploads/posts/2022-01/thumbs/1642682310_17-chakiris-club-p-voina-drakonov-fanfik-fentezi-oboi-17.jpg",
      p:"Взаємне розуміння між Драконом Вогню та Драконом Льоду почало зростати. Вони усвідомили, що мир і гармонія — це ключ до взаємного процвітання, і загроза спричинення безладу втратила свою силу. Здійснилася співдружність, і два дракони знову стали знаками добра та відповідальності у своїх королівствах. За допомогою Кристалу Балансу, дракони звернули свою увагу на те, що об'єднує їх — дбайливе ставлення до всього живого та необхідність збереження магії для майбутніх поколінь. Вони стали керівниками справедливого та прогресивного суспільства, де всі створіння могли жити в злагоді і доброзичливості."
    },
    {
      name: "Це все? Так?",
      img:"https://hips.hearstapps.com/hmg-prod/images/seasmoke-1663003680.jpg?crop=0.736xw:1.00xh;0.0918xw,0&resize=980:*",
      p:"Історія про війну драконів тепер служить нагадуванням про важливість злагоди, розуміння та компромісів в житті. Вона нагадує нам про те, як могутні сили можуть призвести до знищення, але за допомогою мудрості та співпраці можна знайти шлях до миру і гармонії. Кристал Балансу залишився символом цього величного перетворення, і його сила живе в кожному серці, що прагне спокою та єднання."
    },
   ],
   index:0,
  },
});


const rootElement = (                              // Елемент rootElement з використанням StrictMode, який надає обмеження на попередження під час розробки
  <React.StrictMode>
    <Provider store={store}>   {/* Обгортка для передачі Redux store усередині дерева компонентів */}
      <AppView/> {/* Відображення головного компоненту AppView */}
    </Provider>
  </React.StrictMode>
);

const root = createRoot(document.getElementById("container")); // Створюємо корінь додатка з використанням елементу з id "container"
root.render(rootElement);                                      // Рендеримо елемент rootElement в кореневий DOM-вузол
